content/journal/2024-08-07.org
#+title: Held up in Okenno
#+date: 2024-08-07
* Stopping point
- The harbor from which we depart
- Kiordan has a good rep, in terms of treatment of undead
- Dawnfall is pretty nice to the living, unlike most of Geb
- Masquerade: Art, place of work/plying trade for artists
- Blood sport/gladiatorial events as well
- Also a place for people to ply their trade - lawyers, etc. are there often (I Vivien lost some of this point)

* Fennec
Catfolk thaumaturge.
Spinning a throwing knife
Enchanted wedding ring
* Edalyn
- Combat boots
- Prepared
- She had a shimmer over her shoulder
- Seems out of it, muttering and not noticing us until
- Her ghost (on her shoulder) pointed at Margaret
- Claims to be from Absalom, definitely lying
- A shut-in, but people call her things, and also she knows a lot about elephants.
* Fourth Party
- Wearing a ship-of-theseus'd tattered cloak
- Cloak doesn't hide her outfit - she's dressed for the occassion. Very fancy, royalty-coded
- Why's she here? A doctor of some acclaim
- Speciality: Alchemy. Diseases of the heart.
- Margaret is the name she gave, but it's fake.
- She invited us to visit the Mwangi Expanse and see elephants
- She remembers her original name, wants it to stay secret
* Ship
- Sailed off the coast of Geb/Nex
- Skimmer
- Meant for 4-5 passengers, incredibly swift
- Magical sail: Catches breezes that aren't there, skip across the water.
- Helmsman: Wide-brimmed hat that obscures his face.
- A day for the journey.
- The helmsman seems to be looking at Margaret.
- He cracks a whip as if he's driving a horse, that causes the wind
- Mechanism: It's hard to decipher, but there's some combination of a) elemental magic and b) spirits.
- Is the ship magical?
** Private convo
- Lyn spoke to Margaret in private
- Afterward, Lyn is just chilling with the elephant
- Margaret looks shaken
- Conjecture: Lyn doesn't remember the convo.
- There's definitely something on Lyn's shoulder
- Lyn remembers the conversation
- Lyn is kinda meh
* Okenno Port
- The port is not part of Okenno proper
- It's a private dock that's more official, product of a treaty between Katapesh and Okenno. So a stopping-point for diplomats who don't want to worry about pirates.
** Shopping
- Magical trinkets
- Brewery
- Cafe
- Bookstore
- "Misfortune for gold"
*** Misfortune for gold
- Filled with malevolent energy
- We buy and sell curses
- Ghosts attached to people: They don't know much
- I have her card.
- Absalom branch
- Geb branch still operating, they think
- No Nex operations, it became redundant.
*** Den of Magical Secrets
(Fennec did this, not me, so IC I don't know any of this)
- Run by some kind of construct
- Someone recognises Fennec, says "what date is it?"
- Then is unsurprised when Fennec doesn't recognise them.
- Future? Blipping around?
- Geisthall is the weird time-travelling android.
- It said the shop owner won't be around for very long
- Is he killing people?
- "What's that thing on your back?" "As much as I wish I could tell you, I can't."
- It gave Fennec intradimensional crochet purposes.
- Linked pockets, basically,
**** Purses
- Item exists in both purses at the same time
- If people extract it from both purses at the same time, tug of war ensues
- So we can use this to communicate!
- Don't look in the purse, because that'll go badly
- You could fit 3-4 apples in it
*** Private talk with Margaret
- She studied at the best necromancy school
- She's not lying, but she's hiding _a lot_ about her history with Geb
- "I can't eat right now"
- Margaret had a private conversation with Lyn, and Lyn came out looking a little woozy
*** Fennic
- Ring is a repository of knowledge
- "I use the power and I just know"
- So is it sentient
- I need a look inside the purse
** New ship
- Pirates spreading through the port
- Helmsman of the ship - looks identical to our helmsman from before
- The pirates are most likely Nexian.
- The pirates recognised me, and tried to bounty-hunt me.
- They seem to be looking for Margaret (they had a wanted poster that vaguely resembles her)
- So hypothesis: Margaret is undead was working for the Geb war effort somehow?
** Escape
- Two goons disappeared into the alley with Lyn and Margaret.
- Lyn came out, slightly woozy
- Margaret's a vampire, turned against her will, she drank from Lyn and went overboard by accident
** Afterwards: Margaret
- Lyn knew Margaret's original name.
- So the thing on Lyn's shoulder knew Margaret's original name.
- Something bad happened to her in Geb, she fled
- 30 years since she fled, or so.
- My fleeing was about 25 years ago
- She's about 400 years old
- Half-elf
- Fangs are pretty short.
- Do you remember your name? Yes, she does
