public/journal/2024-08-07/index.html
<!DOCTYPE html>
<html lang="en-us">

<head>
  <meta http-equiv="X-Clacks-Overhead" content="GNU Terry Pratchett" />
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
<title>Held up in Okenno | Genevieve&#39;s Journal</title>
<meta name="title" content="Held up in Okenno" />
<meta name="description" content="Stopping point The harbor from which we depart Kiordan has a good rep, in terms of treatment of undead Dawnfall is pretty nice to the living, unlike most of Geb Masquerade: Art, place of work/plying trade for artists Blood sport/gladiatorial events as well Also a place for people to ply their trade - lawyers, etc. are there often (I Vivien lost some of this point) Fennec Catfolk thaumaturge. Spinning a throwing knife Enchanted wedding ring" />
<meta name="author" content="" />
<meta name="keywords" content="" />






  
  <meta property="og:url" content="https://vivianwilde.github.io/blogletters/journal/2024-08-07/">
  <meta property="og:site_name" content="Genevieve&#39;s Journal">
  <meta property="og:title" content="Held up in Okenno">
  <meta property="og:description" content="Stopping point The harbor from which we depart Kiordan has a good rep, in terms of treatment of undead Dawnfall is pretty nice to the living, unlike most of Geb Masquerade: Art, place of work/plying trade for artists Blood sport/gladiatorial events as well Also a place for people to ply their trade - lawyers, etc. are there often (I Vivien lost some of this point) Fennec Catfolk thaumaturge. Spinning a throwing knife Enchanted wedding ring">
  <meta property="og:locale" content="en_us">
  <meta property="og:type" content="article">
    <meta property="article:section" content="journal">
    <meta property="article:published_time" content="2024-08-07T00:00:00+00:00">
    <meta property="article:modified_time" content="2024-08-07T00:00:00+00:00">


  
  
  <meta name="twitter:card" content="summary">
  <meta name="twitter:title" content="Held up in Okenno">
  <meta name="twitter:description" content="Stopping point The harbor from which we depart Kiordan has a good rep, in terms of treatment of undead Dawnfall is pretty nice to the living, unlike most of Geb Masquerade: Art, place of work/plying trade for artists Blood sport/gladiatorial events as well Also a place for people to ply their trade - lawyers, etc. are there often (I Vivien lost some of this point) Fennec Catfolk thaumaturge. Spinning a throwing knife Enchanted wedding ring">


  
  
  <meta itemprop="name" content="Held up in Okenno">
  <meta itemprop="description" content="Stopping point The harbor from which we depart Kiordan has a good rep, in terms of treatment of undead Dawnfall is pretty nice to the living, unlike most of Geb Masquerade: Art, place of work/plying trade for artists Blood sport/gladiatorial events as well Also a place for people to ply their trade - lawyers, etc. are there often (I Vivien lost some of this point) Fennec Catfolk thaumaturge. Spinning a throwing knife Enchanted wedding ring">
  <meta itemprop="datePublished" content="2024-08-07T00:00:00+00:00">
  <meta itemprop="dateModified" content="2024-08-07T00:00:00+00:00">
  <meta itemprop="wordCount" content="753">

<meta name="referrer" content="no-referrer-when-downgrade" />

  
  <link href="/blogletters/original.min.css" rel="stylesheet">

  

  

  
</head>

<body>
  <header><a class="skip-link" href="#main-content">Skip to main content</a>

<a href="/blogletters/" class="title"><h1>Genevieve&#39;s Journal</h1></a>
<nav>
  <a href="/blogletters/journal">Journal</a>

  <a href="/blogletters/about">About</a>









</nav>
</header>
  <main id="main-content">

<h1>Held up in Okenno</h1>
<p class="byline">
  <time datetime='2024-08-07' pubdate>
    2024-08-07
  </time>
  
</p>

<content>
  
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Stopping point
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ul>
<li>The harbor from which we depart</li>
<li>Kiordan has a good rep, in terms of treatment of undead</li>
<li>Dawnfall is pretty nice to the living, unlike most of Geb</li>
<li>Masquerade: Art, place of work/plying trade for artists</li>
<li>Blood sport/gladiatorial events as well</li>
<li>Also a place for people to ply their trade - lawyers, etc. are there often (I Vivien lost some of this point)</li>
</ul>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Fennec
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>Catfolk thaumaturge.
Spinning a throwing knife
Enchanted wedding ring</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Edalyn
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<ul>
<li>Combat boots</li>
<li>Prepared</li>
<li>She had a shimmer over her shoulder</li>
<li>Seems out of it, muttering and not noticing us until</li>
<li>Her ghost (on her shoulder) pointed at Margaret</li>
<li>Claims to be from Absalom, definitely lying</li>
<li>A shut-in, but people call her things, and also she knows a lot about elephants.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Fourth Party
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<ul>
<li>Wearing a ship-of-theseus&#39;d tattered cloak</li>
<li>Cloak doesn&#39;t hide her outfit - she&#39;s dressed for the occassion. Very fancy, royalty-coded</li>
<li>Why&#39;s she here? A doctor of some acclaim</li>
<li>Speciality: Alchemy. Diseases of the heart.</li>
<li>Margaret is the name she gave, but it&#39;s fake.</li>
<li>She invited us to visit the Mwangi Expanse and see elephants</li>
<li>She remembers her original name, wants it to stay secret</li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Ship
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<ul>
<li>Sailed off the coast of Geb/Nex</li>
<li>Skimmer</li>
<li>Meant for 4-5 passengers, incredibly swift</li>
<li>Magical sail: Catches breezes that aren&#39;t there, skip across the water.</li>
<li>Helmsman: Wide-brimmed hat that obscures his face.</li>
<li>A day for the journey.</li>
<li>The helmsman seems to be looking at Margaret.</li>
<li>He cracks a whip as if he&#39;s driving a horse, that causes the wind</li>
<li>Mechanism: It&#39;s hard to decipher, but there&#39;s some combination of a) elemental magic and b) spirits.</li>
<li>Is the ship magical?</li>
</ul>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Private convo
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<ul>
<li>Lyn spoke to Margaret in private</li>
<li>Afterward, Lyn is just chilling with the elephant</li>
<li>Margaret looks shaken</li>
<li>Conjecture: Lyn doesn&#39;t remember the convo.</li>
<li>There&#39;s definitely something on Lyn&#39;s shoulder</li>
<li>Lyn remembers the conversation</li>
<li>Lyn is kinda meh</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
Okenno Port
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<ul>
<li>The port is not part of Okenno proper</li>
<li>It&#39;s a private dock that&#39;s more official, product of a treaty between Katapesh and Okenno. So a stopping-point for diplomats who don&#39;t want to worry about pirates.</li>
</ul>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Shopping
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<ul>
<li>Magical trinkets</li>
<li>Brewery</li>
<li>Cafe</li>
<li>Bookstore</li>
<li>&#34;Misfortune for gold&#34;</li>
</ul>
<div id="outline-container-headline-9" class="outline-4">
<h4 id="headline-9">
Misfortune for gold
</h4>
<div id="outline-text-headline-9" class="outline-text-4">
<ul>
<li>Filled with malevolent energy</li>
<li>We buy and sell curses</li>
<li>Ghosts attached to people: They don&#39;t know much</li>
<li>I have her card.</li>
<li>Absalom branch</li>
<li>Geb branch still operating, they think</li>
<li>No Nex operations, it became redundant.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-10" class="outline-4">
<h4 id="headline-10">
Den of Magical Secrets
</h4>
<div id="outline-text-headline-10" class="outline-text-4">
<p>(Fennec did this, not me, so IC I don&#39;t know any of this)</p>
<ul>
<li>Run by some kind of construct</li>
<li>Someone recognises Fennec, says &#34;what date is it?&#34;</li>
<li>Then is unsurprised when Fennec doesn&#39;t recognise them.</li>
<li>Future? Blipping around?</li>
<li>Geisthall is the weird time-travelling android.</li>
<li>It said the shop owner won&#39;t be around for very long</li>
<li>Is he killing people?</li>
<li>&#34;What&#39;s that thing on your back?&#34; &#34;As much as I wish I could tell you, I can&#39;t.&#34;</li>
<li>It gave Fennec intradimensional crochet purposes.</li>
<li>Linked pockets, basically,</li>
</ul>
<div id="outline-container-headline-11" class="outline-5">
<h5 id="headline-11">
Purses
</h5>
<div id="outline-text-headline-11" class="outline-text-5">
<ul>
<li>Item exists in both purses at the same time</li>
<li>If people extract it from both purses at the same time, tug of war ensues</li>
<li>So we can use this to communicate!</li>
<li>Don&#39;t look in the purse, because that&#39;ll go badly</li>
<li>You could fit 3-4 apples in it</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-12" class="outline-4">
<h4 id="headline-12">
Private talk with Margaret
</h4>
<div id="outline-text-headline-12" class="outline-text-4">
<ul>
<li>She studied at the best necromancy school</li>
<li>She&#39;s not lying, but she&#39;s hiding <span style="text-decoration: underline;">a lot</span> about her history with Geb</li>
<li>&#34;I can&#39;t eat right now&#34;</li>
<li>Margaret had a private conversation with Lyn, and Lyn came out looking a little woozy</li>
</ul>
</div>
</div>
<div id="outline-container-headline-13" class="outline-4">
<h4 id="headline-13">
Fennic
</h4>
<div id="outline-text-headline-13" class="outline-text-4">
<ul>
<li>Ring is a repository of knowledge</li>
<li>&#34;I use the power and I just know&#34;</li>
<li>So is it sentient</li>
<li>I need a look inside the purse</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
New ship
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<ul>
<li>Pirates spreading through the port</li>
<li>Helmsman of the ship - looks identical to our helmsman from before</li>
<li>The pirates are most likely Nexian.</li>
<li>The pirates recognised me, and tried to bounty-hunt me.</li>
<li>They seem to be looking for Margaret (they had a wanted poster that vaguely resembles her)</li>
<li>So hypothesis: Margaret is undead was working for the Geb war effort somehow?</li>
</ul>
</div>
</div>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
Escape
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<ul>
<li>Two goons disappeared into the alley with Lyn and Margaret.</li>
<li>Lyn came out, slightly woozy</li>
<li>Margaret&#39;s a vampire, turned against her will, she drank from Lyn and went overboard by accident</li>
</ul>
</div>
</div>
<div id="outline-container-headline-16" class="outline-3">
<h3 id="headline-16">
Afterwards: Margaret
</h3>
<div id="outline-text-headline-16" class="outline-text-3">
<ul>
<li>Lyn knew Margaret&#39;s original name.</li>
<li>So the thing on Lyn&#39;s shoulder knew Margaret&#39;s original name.</li>
<li>Something bad happened to her in Geb, she fled</li>
<li>30 years since she fled, or so.</li>
<li>My fleeing was about 25 years ago</li>
<li>She&#39;s about 400 years old</li>
<li>Half-elf</li>
<li>Fangs are pretty short.</li>
<li>Do you remember your name? Yes, she does</li>
</ul>
</div>
</div>
</div>
</div>

</content>
<p>
  
</p>




  </main>
  <footer><small>
   | 
</small></footer>

    
</body>

</html>
